Github Master Repo/Cube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-2 -2 2)
    (-2 2 2)
    (-2 2 -2)
    (-2 -2 -2)
    (2 -2 2)
    (2 -2 -2)
    (2 2 -2)
    (2 2 2)
);

blocks
(
    hex (3 5 6 2 0 4 7 1) (32 32 32) simpleGrading (1 1 1)
)

edges
(
);

patches
(
);

mergePatchPairs
(
);



// ************************************************************************* //
